Repository: pavlovskyive/UppScale
Catalog: ImageUpscaler/Resources/Localization/*.lproj/Localizable.strings
Languages: uk

# processing.superResolution.title
source: Super Resolution
uk: Супер-роздільність

# processing.lightEnhancement.title
source: Enhance Lighting
uk: Висвітлення

# processing.superResolution.subtitle
source: Improve Image Quality
uk: Покращення якості зображення

# processing.lightEnhancement.subtitle
source: Enhance Lighting in Dark Images
uk: Підвищення освітлення в темних зображеннях

# processing.superResolution.actionTitle
source: Upscale
uk: Збільшити роздільність

# processing.lightEnhancement.actionTitle
source: Enhance
uk: Висвітлити

# processing.superResolution.usageNote
source: For best results, use small images. Super Resolution improves image quality and enhances details by increasing the resolution of low-resolution images
uk: Для отримання найкращих результатів використовуйте невеликі зображення. Супер-роздільність покращує якість зображення та надає більше деталей шляхом збільшення роздільної здатності низької роздільності

# processing.lightEnhancement.usageNote
source: This method is effective for very dark images. It enhances lighting and brings out details in shadow areas. For best results, try combining this method with Super Resolution
uk: Цей метод ефективний для дуже темних зображень. Він підвищує освітленість та виділяє деталі в тіньових областях. Для отримання найкращих результатів спробуйте поєднати цей метод зі Супер-роздільністю

# processing.update.modelLoading
source: Loading model
uk: Завантаження моделі

# processing.update.processingTile
source: Processing
uk: Обробка

# processing.update.completed
source: Completed
uk: Завершено

# processing.update.canceled
source: Canceled
uk: Скасовано

# button.reset
source: Reset
uk: Скинути

# button.back
source: Back
uk: Назад

# button.settings
source: Settings
uk: Налаштування

# button.compare
source: Compare
uk: Порівняти

# button.next
source: Next
uk: Далі

# button.process
source: Process
uk: Обробити

# button.share
source: Save | Share
uk: Зберегти | Поділитися

# button.cancel
source: Cancel
uk: Скасувати

# button.properties
source: Properties
uk: Властивості

# dialogue.question.continueWithImage
source: Continue with processed image?
uk: Продовжити з обробленим зображенням?

# dialogue.question.processingMethod
source: Choose processing method
uk: Оберіть метод обробки

# label.processedImage
source: Processed Image
uk: Оброблене зображення

# label.completed
source: Completed
uk: Завершено

# label.actionCompleted
source: Action completed successfully
uk: Дія успішно завершена

# label.tileSize
source: Tile Size
uk: Розмір плитки

# label.overlap
source: Overlap
uk: Накладання

# label.tileSizeNote
source: Smaller tile size can improve output quality but may require more processing time
uk: Менший розмір плитки може покращити якість виводу, але може займати більше часу для обробки

# label.overlapNote
source: Increasing overlap can help preserve continuity in output but may increase processing time
uk: Збільшення накладання може допомогти зберегти послідовність виводу, але може збільшити час обробки

# label.properties
source: Properties
uk: Властивості

# label.width
source: Width
uk: Ширина

# label.height
source: Height
uk: Висота

# label.resolution
source: Resolution
uk: Роздільність

# label.loadingModel
source: Loading model
uk: Завантаження моделі

# label.processing
source: Processing
uk: Обробка

# label.output
source: Output
uk: Вивід

# label.model
source: Model
uk: Модель

# label.type
source: Type
uk: Тип

# label.hint
source: Hint
uk: Підказка

# label.processingParameters.title
source: Processing Parameters
uk: Параметри обробки

# label.processingParameters.tileSize.subtitle
source: Select the size of each tile for processing
uk: Виберіть розмір кожної плитки для обробки

# label.processingParameters.overlap.subtitle
source: Adjust the amount of overlap between adjacent tiles
uk: Відрегулюйте кількість накладання між сусідніми плитками

# label.processingParameters.tileSize.note
source: Smaller tile size can improve output quality but may require more processing time
uk: Менший розмір плитки може покращити якість виводу, але може займати більше часу для обробки

# label.processingParameters.overlap.note
source: Increasing overlap can help preserve continuity in output but may increase processing time
uk: Збільшення накладання може допомогти зберегти послідовність виводу, але може збільшити час обробки

# error.modelLoading.description
source: Failed to load the processing model
uk: Не вдалося завантажити модель обробки

# error.invalidData.description
source: Invalid image data
uk: Недійсні дані зображення

# error.tiling.description
source: Failed to divide the image into tiles
uk: Не вдалося розділити зображення на плитки

# error.processing.description
source: Failed to process the image
uk: Не вдалося обробити зображення

# error.postprocessing.description
source: Failed to post-process the image
uk: Не вдалося виконати післяобробку зображення

# error.modelLoading.suggestion
source: Please try restarting the application or try again later
uk: Будь ласка, спробуйте перезапустити додаток або спробуйте пізніше

# error.invalidData.suggestion
source: Please try reloading the image or choose another image
uk: Будь ласка, спробуйте перезавантажити зображення або виберіть інше зображення

# error.tiling.suggestion
source: Please try restarting the application or try again later
uk: Будь ласка, спробуйте перезапустити додаток або спробуйте пізніше

# error.processing.suggestion
source: Please try again or choose another image
uk: Будь ласка, спробуйте ще раз або виберіть інше зображення

# error.postprocessing.suggestion
source: Please try again or choose another image
uk: Будь ласка, спробуйте ще раз або виберіть інше зображення
